wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/ble_at_repl.c
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#if defined(__has_include)
#if __has_include("NuMicro.h")
#include "NuMicro.h"
#else
#include "host_compat.h"
#endif
#else
#include "NuMicro.h"
#endif

#include "project_config.h"
#include "ble_at_repl.h"
#include "system_status.h"
#include "drivers/timer.h"
#include "drivers/led.h"
#include "drivers/buzzer.h"
#include "drivers/gsensor.h"
#include "drivers/adc.h"
#include "ble.h"
#include "fmc.h"

#if USE_BLE_AT_REPL

#define REPL_PREFIX "AT+TEST,"
#define REPL_STREAM_MIN_INTERVAL_MS 50u
#define REPL_STREAM_MAX_INTERVAL_MS 2000u

/* Firmware version from project_config.h: FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME */

/* ---------- Data Flash layout ---------- */
/* The last page (4 KB) of APROM is reserved as Data Flash for user parameters.
 * Adjust DFLASH_BASE if Config0 DFBA is set differently.                     */
#define DFLASH_BASE 0x0007F000UL /* last 4 KB page of 512 KB APROM */
#define DFLASH_SIZE 0x1000UL     /* 4 KB = 1 page                  */
#define DFLASH_MAX_RW_LEN 64u    /* max words per single R/W cmd   */

/* ---------- Unified error codes ---------- */
#define ERR_STATE "STATE" /* command not allowed in current state     */
#define ERR_PARAM "PARAM" /* invalid / missing parameter              */
#define ERR_CMD "CMD"     /* unknown command                          */
#define ERR_BUSY "BUSY"   /* resource busy (e.g. stream running)      */
#define ERR_FLASH "FLASH" /* Data-Flash operation failed              */
#define ERR_RANGE "RANGE" /* address / length out of range            */
#define ERR_ALIGN "ALIGN" /* address not 4-byte aligned               */

typedef struct
{
    uint8_t stream_source;
    uint8_t stream_enabled;
    uint32_t stream_interval_ms;
    uint32_t last_stream_ms;
} BleAtReplCtx;

typedef enum
{
    REPL_STREAM_SRC_GSENSOR = 0,
    REPL_STREAM_SRC_ADC,
    REPL_STREAM_SRC_HALL,
    REPL_STREAM_SRC_KEY
} ReplStreamSource;

static BleAtReplCtx s_repl;

static int repl_send(const char *fmt, ...)
{
    /* Increase local buffer to avoid truncation for long HELP / INFO replies. */
    char out[512];
    va_list ap;
    va_start(ap, fmt);
    int len = vsnprintf(out, sizeof(out), fmt, ap);
    va_end(ap);
    if (len < 0)
    {
        return len;
    }
    return BLE_UART_SEND((void *)UART1, "%s", out);
}

static void repl_send_ok(const char *cmd, const char *payload)
{
    if (payload && payload[0] != '\0')
    {
        repl_send("+OK,%s,%s\r\n", cmd, payload);
    }
    else
    {
        repl_send("+OK,%s\r\n", cmd);
    }
}

static void repl_send_err(const char *code, const char *msg)
{
    repl_send("+ERR,%s,%s\r\n", code, msg);
}

static const char *skip_prefix(const char *msg)
{
    size_t plen = strlen(REPL_PREFIX);
    if (!msg)
    {
        return NULL;
    }
    if (strncmp(msg, REPL_PREFIX, plen) == 0)
    {
        return msg + plen;
    }
    return NULL;
}

static uint32_t clamp_stream_interval(uint32_t req)
{
    if (req < REPL_STREAM_MIN_INTERVAL_MS)
    {
        return REPL_STREAM_MIN_INTERVAL_MS;
    }
    if (req > REPL_STREAM_MAX_INTERVAL_MS)
    {
        return REPL_STREAM_MAX_INTERVAL_MS;
    }
    return req;
}

static uint8_t parse_stream_source(const char *token, uint8_t *out_source)
{
    if (!token || !out_source)
    {
        return 0u;
    }

    if (strcmp(token, "GSENSOR") == 0 || strcmp(token, "SENSOR") == 0)
    {
        *out_source = (uint8_t)REPL_STREAM_SRC_GSENSOR;
        return 1u;
    }
    if (strcmp(token, "ADC") == 0)
    {
        *out_source = (uint8_t)REPL_STREAM_SRC_ADC;
        return 1u;
    }
    if (strcmp(token, "HALL") == 0)
    {
        *out_source = (uint8_t)REPL_STREAM_SRC_HALL;
        return 1u;
    }
    if (strcmp(token, "KEY") == 0)
    {
        *out_source = (uint8_t)REPL_STREAM_SRC_KEY;
        return 1u;
    }
    return 0u;
}

static const char *stream_source_name(uint8_t source)
{
    switch (source)
    {
    case REPL_STREAM_SRC_ADC:
        return "ADC";
    case REPL_STREAM_SRC_HALL:
        return "HALL";
    case REPL_STREAM_SRC_KEY:
        return "KEY";
    case REPL_STREAM_SRC_GSENSOR:
    default:
        return "GSENSOR";
    }
}

static uint8_t is_decimal_number(const char *s)
{
    size_t i;
    if (!s || s[0] == '\0')
    {
        return 0u;
    }
    for (i = 0u; s[i] != '\0'; i++)
    {
        if (s[i] < '0' || s[i] > '9')
        {
            return 0u;
        }
    }
    return 1u;
}

static void trim_line_end(char *s)
{
    size_t len;
    if (!s)
    {
        return;
    }

    len = strlen(s);
    while (len > 0u)
    {
        char c = s[len - 1u];
        if (c == '\r' || c == '\n' || c == ' ' || c == '\t')
        {
            s[len - 1u] = '\0';
            len--;
        }
        else
        {
            break;
        }
    }
}

/* Simple decimal float parser — avoids ARM microlib strtof/strtod which
 * internally use the global scanf stream (blocking on UART after UART_Open). */
static float repl_parse_float(const char *s)
{
    long int_part = 0;
    long frac_part = 0;
    long frac_div = 1;
    int neg = 0;
    if (*s == '-') { neg = 1; s++; }
    while (*s >= '0' && *s <= '9') { int_part = int_part * 10 + (*s++ - '0'); }
    if (*s == '.')
    {
        s++;
        while (*s >= '0' && *s <= '9')
        {
            frac_part = frac_part * 10 + (*s++ - '0');
            frac_div *= 10;
        }
    }
    float result = (float)int_part + (float)frac_part / (float)frac_div;
    return neg ? -result : result;
}

void BleAtRepl_Init(void)
{
    memset(&s_repl, 0, sizeof(s_repl));
    s_repl.stream_source = (uint8_t)REPL_STREAM_SRC_GSENSOR;
    s_repl.stream_interval_ms = 200u;
    Sys_SetReplMode(0u);
}

uint8_t BleAtRepl_IsActive(void)
{
    return Sys_GetReplMode();
}

static void repl_activate(void)
{
    Sys_SetReplMode(1u);
    Sys_SetGameState(GAME_STOP);
    Sys_SetIdleState(0u);
    s_repl.last_stream_ms = get_ticks_ms();
    /* When entering REPL, stop the main blink engine so REPL LED commands
       (LED_ON / LED_OFF / LED_BLINK) take immediate and persistent effect. */
    SetGreenLedMode(0, 0);
    SetGreenLed(0);
    DBG_PRINT("[REPL] Activated - disabled main LED blink and cleared LED\n");
}

static void handle_repl_start(void)
{
    repl_activate();
    repl_send_ok("REPL_START", "READY");
}

static void handle_repl_stop(void)
{
    s_repl.stream_enabled = 0u;
    Sys_SetReplMode(0u);
    /* Clear any LED override when exiting REPL to let main resume control */
    Sys_SetLedOverride(0u);
    repl_send_ok("REPL_STOP", "BYE");
}

