wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/ble_at_repl.c
static void handle_led_cmd(const char *args)
{
    if (strcmp(args, "LED_ON") == 0)
    {
        DBG_PRINT("[REPL] LED_ON\n");
        Sys_SetLedOverride(1u);
        /* Stop blink engine first so Timer ISR won't override the pin */
        SetGreenLedMode(0, 0);
        SetGreenLed(1u);
        repl_send_ok("LED_ON", "1");
        return;
    }
    if (strcmp(args, "LED_OFF") == 0)
    {
        DBG_PRINT("[REPL] LED_OFF\n");
        Sys_SetLedOverride(1u);
        /* Stop blink engine first so Timer ISR won't override the pin */
        SetGreenLedMode(0, 0);
        SetGreenLed(0u);
        repl_send_ok("LED_OFF", "0");
        return;
    }
    if (strncmp(args, "LED_BLINK", 9) == 0)
    {
        float freq = 2.0f;
        float duty = 0.5f;
        const char *p = args + 9;
        if (*p == ',')
        {
            p++;
            freq = repl_parse_float(p);
            const char *comma = strchr(p, ',');
            if (comma)
            {
                duty = repl_parse_float(comma + 1);
            }
        }
        if (freq <= 0.0f)
        {
            repl_send_err(ERR_PARAM, "LED_BLINK_FREQ");
            return;
        }
        DBG_PRINT("[REPL] LED_BLINK -> SetGreenLedMode(freq=%.2f,duty=%.2f)\n", freq, duty);
        Sys_SetLedOverride(1u);
        SetGreenLedMode(freq, duty);
        repl_send_ok("LED_BLINK", "APPLIED");
        return;
    }

    repl_send_err(ERR_CMD, "LED");
}

static void handle_buzzer_cmd(const char *args)
{
    if (strcmp(args, "BUZZER_ON") == 0)
    {
        Buzzer_Start(1000u);
        repl_send_ok("BUZZER_ON", "1000");
        return;
    }
    if (strcmp(args, "BUZZER_OFF") == 0)
    {
        Buzzer_Stop();
        repl_send_ok("BUZZER_OFF", "0");
        return;
    }
    if (strncmp(args, "BUZZER_BEEP", 11) == 0)
    {
        uint32_t freq = 1500u;
        uint32_t dur = 150u;
        const char *p = args + 11;
        if (*p == ',')
        {
            p++;
            freq = (uint32_t)strtoul(p, NULL, 10);
            const char *comma = strchr(p, ',');
            if (comma)
            {
                dur = (uint32_t)strtoul(comma + 1, NULL, 10);
            }
        }
        if (freq == 0u || dur == 0u)
        {
            repl_send_err(ERR_PARAM, "BUZZER_BEEP");
            return;
        }
        BuzzerPlay(freq, dur);
        repl_send_ok("BUZZER_BEEP", "DONE");
        return;
    }

    repl_send_err(ERR_CMD, "BUZZER");
}

static void handle_sensor_read(void)
{
    int16_t axis[3] = {0};
    GsensorReadAxis(axis);
    repl_send("+OK,SENSOR_READ,%d,%d,%d\r\n", axis[0], axis[1], axis[2]);
}

static void handle_sensor_stream(const char *args)
{
    if (strncmp(args, "SENSOR_STREAM,QUERY", 19) == 0)
    {
        repl_send("+OK,SENSOR_STREAM,QUERY,EN=%u,SRC=%s,INT=%lu\r\n",
                  (unsigned)s_repl.stream_enabled,
                  stream_source_name(s_repl.stream_source),
                  (unsigned long)s_repl.stream_interval_ms);
        return;
    }

    if (strncmp(args, "SENSOR_STREAM,STOP", 18) == 0)
    {
        s_repl.stream_enabled = 0u;
        repl_send_ok("SENSOR_STREAM", "STOP");
        return;
    }

    if (strncmp(args, "SENSOR_STREAM,START", 19) == 0)
    {
        uint8_t source = s_repl.stream_source;
        uint32_t interval = s_repl.stream_interval_ms;
        if (args[19] == ',')
        {
            char params[64];
            char *token1;
            char *token2;
            char *comma;

            strncpy(params, args + 20, sizeof(params) - 1u);
            params[sizeof(params) - 1u] = '\0';

            comma = strchr(params, ',');
            if (comma)
            {
                *comma = '\0';
                token1 = params;
                token2 = comma + 1;
            }
            else
            {
                token1 = params;
                token2 = NULL;
            }

            if (token1 && token1[0] != '\0')
            {
                if (parse_stream_source(token1, &source))
                {
                    if (token2 && token2[0] != '\0')
                    {
                        if (!is_decimal_number(token2))
                        {
                            repl_send_err(ERR_PARAM, "SENSOR_STREAM_INTERVAL");
                            return;
                        }
                        interval = (uint32_t)strtoul(token2, NULL, 10);
                    }
                }
                else
                {
                    if (!is_decimal_number(token1))
                    {
                        repl_send_err(ERR_PARAM, "SENSOR_STREAM_SOURCE");
                        return;
                    }
                    interval = (uint32_t)strtoul(token1, NULL, 10);
                }
            }
        }
        interval = clamp_stream_interval(interval);
        s_repl.stream_source = source;
        s_repl.stream_interval_ms = interval;
        s_repl.stream_enabled = 1u;
        s_repl.last_stream_ms = get_ticks_ms();
        repl_send("+OK,SENSOR_STREAM,START,%s,%lu\r\n", stream_source_name(source), (unsigned long)interval);
        return;
    }

    repl_send_err(ERR_PARAM, "SENSOR_STREAM");
}

static void handle_adc_read(void)
{
    Adc_UpdateVdda();
    float vdda = Adc_GetVdda();
    repl_send("+OK,ADC_READ,VDDA_MV=%u\r\n", (unsigned)(uint32_t)(vdda * 1000.0f));
}

static void handle_hall_read(void)
{
    uint8_t pb7_low = ((PB->PIN & BIT7) == 0u) ? 1u : 0u;
    uint8_t pb8_low = ((PB->PIN & BIT8) == 0u) ? 1u : 0u;
    repl_send("+OK,HALL_READ,PB7=%u,PB8=%u\r\n", pb7_low, pb8_low);
}

static void handle_key_read(void)
{
    uint8_t pressed = ((PB->PIN & BIT15) == 0u) ? 1u : 0u;
    repl_send("+OK,KEY_READ,PB15=%u\r\n", pressed);
}

/* ===================== PING ===================== */
static void handle_ping(void)
{
    repl_send("+OK,PING,PONG\r\n");
}

/* ===================== VERSION ===================== */
static void handle_version(void)
{
    repl_send("+OK,VERSION,%s,%s,%s\r\n",
              FW_VERSION, FW_BUILD_DATE, FW_BUILD_TIME);
}

