wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/ble_at_repl.c
/* =================== Data Flash =================== */
static void handle_dflash_info(void)
{
    SYS_UnlockReg();
    FMC_Open();
    uint32_t dfba = FMC_ReadDataFlashBaseAddr();
    FMC_Close();
    SYS_LockReg();
    repl_send("+OK,DFLASH_INFO,BASE=0x%08X,SIZE=0x%X,PAGE=0x%X\r\n",
              (unsigned)dfba, (unsigned)DFLASH_SIZE, (unsigned)FMC_FLASH_PAGE_SIZE);
}

static void handle_dflash_read(const char *params)
{
    /* Format: DFLASH_READ,<hex_offset>[,<word_count>]  (count default=1, max=DFLASH_MAX_RW_LEN) */
    uint32_t offset = 0u;
    uint32_t count = 1u;
    char buf[64];
    uint32_t i;

    if (!params || params[0] == '\0')
    {
        repl_send_err(ERR_PARAM, "DFLASH_READ_OFFSET");
        return;
    }

    strncpy(buf, params, sizeof(buf) - 1u);
    buf[sizeof(buf) - 1u] = '\0';

    char *comma = strchr(buf, ',');
    if (comma)
    {
        *comma = '\0';
        count = (uint32_t)strtoul(comma + 1, NULL, 0);
    }
    offset = (uint32_t)strtoul(buf, NULL, 16);

    if (offset & 0x3u)
    {
        repl_send_err(ERR_ALIGN, "DFLASH_READ_OFFSET");
        return;
    }
    if (count == 0u || count > DFLASH_MAX_RW_LEN)
    {
        repl_send_err(ERR_RANGE, "DFLASH_READ_COUNT");
        return;
    }
    if (offset + count * 4u > DFLASH_SIZE)
    {
        repl_send_err(ERR_RANGE, "DFLASH_READ_END");
        return;
    }

    SYS_UnlockReg();
    FMC_Open();

    for (i = 0u; i < count; i++)
    {
        uint32_t addr = DFLASH_BASE + offset + i * 4u;
        uint32_t val = FMC_Read(addr);
        repl_send("+OK,DFLASH_READ,0x%04X,0x%08X\r\n",
                  (unsigned)(offset + i * 4u), (unsigned)val);
    }

    FMC_Close();
    SYS_LockReg();
}

static void handle_dflash_write(const char *params)
{
    /* Format: DFLASH_WRITE,<hex_offset>,<hex_value>  (single word) */
    uint32_t offset = 0u;
    uint32_t value = 0u;
    char buf[64];

    if (!params || params[0] == '\0')
    {
        repl_send_err(ERR_PARAM, "DFLASH_WRITE_PARAMS");
        return;
    }

    strncpy(buf, params, sizeof(buf) - 1u);
    buf[sizeof(buf) - 1u] = '\0';

    char *comma = strchr(buf, ',');
    if (!comma)
    {
        repl_send_err(ERR_PARAM, "DFLASH_WRITE_VALUE");
        return;
    }
    *comma = '\0';
    offset = (uint32_t)strtoul(buf, NULL, 16);
    value = (uint32_t)strtoul(comma + 1, NULL, 16);

    if (offset & 0x3u)
    {
        repl_send_err(ERR_ALIGN, "DFLASH_WRITE_OFFSET");
        return;
    }
    if (offset + 4u > DFLASH_SIZE)
    {
        repl_send_err(ERR_RANGE, "DFLASH_WRITE_OFFSET");
        return;
    }

    SYS_UnlockReg();
    FMC_Open();
    FMC_ENABLE_AP_UPDATE();

    int32_t ret = FMC_Write(DFLASH_BASE + offset, value);

    FMC_DISABLE_AP_UPDATE();
    FMC_Close();
    SYS_LockReg();

    if (ret != 0)
    {
        repl_send_err(ERR_FLASH, "DFLASH_WRITE_FAIL");
        return;
    }
    repl_send("+OK,DFLASH_WRITE,0x%04X,0x%08X\r\n",
              (unsigned)offset, (unsigned)value);
}

static void handle_dflash_erase(void)
{
    SYS_UnlockReg();
    FMC_Open();
    FMC_ENABLE_AP_UPDATE();

    int32_t ret = FMC_Erase(DFLASH_BASE);

    FMC_DISABLE_AP_UPDATE();
    FMC_Close();
    SYS_LockReg();

    if (ret != 0)
    {
        repl_send_err(ERR_FLASH, "DFLASH_ERASE_FAIL");
        return;
    }
    repl_send_ok("DFLASH_ERASE", "DONE");
}

static void handle_dflash_cmd(const char *args)
{
    if (strcmp(args, "DFLASH_INFO") == 0)
    {
        handle_dflash_info();
        return;
    }
    if (strncmp(args, "DFLASH_READ,", 12) == 0)
    {
        handle_dflash_read(args + 12);
        return;
    }
    if (strcmp(args, "DFLASH_READ") == 0)
    {
        repl_send_err(ERR_PARAM, "DFLASH_READ_OFFSET");
        return;
    }
    if (strncmp(args, "DFLASH_WRITE,", 13) == 0)
    {
        if (!Sys_GetReplMode())
        {
            repl_send_err(ERR_STATE, "NOT_IN_REPL");
            return;
        }
        handle_dflash_write(args + 13);
        return;
    }
    if (strcmp(args, "DFLASH_WRITE") == 0)
    {
        repl_send_err(ERR_PARAM, "DFLASH_WRITE_PARAMS");
        return;
    }
    if (strcmp(args, "DFLASH_ERASE") == 0)
    {
        if (!Sys_GetReplMode())
        {
            repl_send_err(ERR_STATE, "NOT_IN_REPL");
            return;
        }
        handle_dflash_erase();
        return;
    }
    repl_send_err(ERR_CMD, "DFLASH");
}

/* ===================== HELP ===================== */
static void handle_help(void)
{
    /* Use repl_send_ok to keep formatting consistent and avoid overly long
       single-format calls which may be truncated in intermediate buffers. */
    repl_send_ok("HELP",
                 "PING|VERSION|REPL_START|REPL_STOP|REPL_STATE|"
                 "STATUS|STATUS_VERBOSE|"
                 "LED_ON|LED_OFF|LED_BLINK|"
                 "BUZZER_ON|BUZZER_OFF|BUZZER_BEEP|"
                 "SENSOR_READ|SENSOR_STREAM|"
                 "ADC_READ|HALL_READ|KEY_READ|"
                 "DFLASH_INFO|DFLASH_READ|DFLASH_WRITE|DFLASH_ERASE");
}

static void handle_repl_state(void)
{
    repl_send("+OK,REPL_STATE,ACTIVE=%u,STREAM_EN=%u,SRC=%s,INT=%lu\r\n",
              (unsigned)Sys_GetReplMode(),
              (unsigned)s_repl.stream_enabled,
              stream_source_name(s_repl.stream_source),
              (unsigned long)s_repl.stream_interval_ms);
}

static void handle_status(void)
{
    repl_send("+OK,STATUS,BLE=%u,GAME=%u,REPL=%u,IDLE=%u,JUMP=%u\r\n",
              (unsigned)Sys_GetBleState(),
              (unsigned)Sys_GetGameState(),
              (unsigned)Sys_GetReplMode(),
              (unsigned)Sys_GetIdleState(),
              (unsigned)Sys_GetJumpTimes());
}

static void handle_status_verbose(void)
{
    int16_t axis[3] = {0};
    Adc_UpdateVdda();
    float vdda = Adc_GetVdda();
    uint8_t pb7_low = ((PB->PIN & BIT7) == 0u) ? 1u : 0u;
    uint8_t pb8_low = ((PB->PIN & BIT8) == 0u) ? 1u : 0u;
    uint8_t key_pressed = ((PB->PIN & BIT15) == 0u) ? 1u : 0u;

    GsensorReadAxis(axis);

    uint32_t vdda_mv = (uint32_t)(vdda * 1000.0f);
    repl_send("+OK,STATUS_VERBOSE,BLE=%u,GAME=%u,REPL=%u,IDLE=%u,JUMP=%u,KEY=%u,PB7=%u,PB8=%u,VDDA=%lu.%03lu\r\n",
              (unsigned)Sys_GetBleState(),
              (unsigned)Sys_GetGameState(),
              (unsigned)Sys_GetReplMode(),
              (unsigned)Sys_GetIdleState(),
              (unsigned)Sys_GetJumpTimes(),
              (unsigned)key_pressed,
              (unsigned)pb7_low,
              (unsigned)pb8_low,
              (unsigned long)(vdda_mv / 1000u), (unsigned long)(vdda_mv % 1000u));
    repl_send("+OK,STATUS_VERBOSE_G,AX=%d,AY=%d,AZ=%d\r\n", axis[0], axis[1], axis[2]);
}

