wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/ble_at_repl.c
static uint8_t handle_safe_or_common_cmd(const char *cmd)
{
    if (strncmp(cmd, "LED_", 4) == 0)
    {
        handle_led_cmd(cmd);
        return 1u;
    }

    if (strncmp(cmd, "BUZZER_", 7) == 0)
    {
        handle_buzzer_cmd(cmd);
        return 1u;
    }

    if (strcmp(cmd, "SENSOR_READ") == 0)
    {
        handle_sensor_read();
        return 1u;
    }

    if (strcmp(cmd, "ADC_READ") == 0)
    {
        handle_adc_read();
        return 1u;
    }

    if (strcmp(cmd, "HALL_READ") == 0)
    {
        handle_hall_read();
        return 1u;
    }

    if (strcmp(cmd, "KEY_READ") == 0)
    {
        handle_key_read();
        return 1u;
    }

    /* Allow DataFlash info/read queries outside REPL; write/erase require REPL */
    if (strncmp(cmd, "DFLASH_INFO", 11) == 0 || strncmp(cmd, "DFLASH_READ", 11) == 0)
    {
        handle_dflash_cmd(cmd);
        return 1u;
    }

    return 0u;
}

uint8_t BleAtRepl_HandleMessage(const char *msg)
{
    char msg_local[RXBUFSIZE];
    const char *cmd;

    if (!msg)
    {
        return 0u;
    }

    strncpy(msg_local, msg, sizeof(msg_local) - 1u);
    msg_local[sizeof(msg_local) - 1u] = '\0';
    trim_line_end(msg_local);

    cmd = skip_prefix(msg_local);

    if (!cmd)
    {
        return 0u;
    }
    DBG_PRINT("[REPL] Received cmd: %s\n", cmd);

    /* --- Commands that work regardless of REPL state --- */

    if (strcmp(cmd, "PING") == 0)
    {
        handle_ping();
        return 1u;
    }

    if (strcmp(cmd, "VERSION") == 0)
    {
        handle_version();
        return 1u;
    }

    if (strcmp(cmd, "REPL_START") == 0)
    {
        handle_repl_start();
        return 1u;
    }

    if (strcmp(cmd, "REPL_STOP") == 0)
    {
        handle_repl_stop();
        return 1u;
    }

    if (strcmp(cmd, "HELP") == 0)
    {
        handle_help();
        return 1u;
    }

    if (strcmp(cmd, "STATUS") == 0)
    {
        handle_status();
        return 1u;
    }

    if (strcmp(cmd, "REPL_STATE") == 0)
    {
        handle_repl_state();
        return 1u;
    }

    if (strcmp(cmd, "STATUS_VERBOSE") == 0)
    {
        handle_status_verbose();
        return 1u;
    }

    /* --- Commands we allow outside REPL (safe/read-only or explicitly permitted) --- */
    if (handle_safe_or_common_cmd(cmd))
    {
        return 1u;
    }

    if (!BleAtRepl_IsActive() && strncmp(cmd, "SENSOR_STREAM,START", 19) == 0)
    {
        repl_activate();
        handle_sensor_stream(cmd);
        return 1u;
    }

    if (!BleAtRepl_IsActive() && strncmp(cmd, "SENSOR_STREAM,STOP", 18) == 0)
    {
        s_repl.stream_enabled = 0u;
        repl_send_ok("SENSOR_STREAM", "STOP");
        return 1u;
    }

    if (!BleAtRepl_IsActive() && strncmp(cmd, "SENSOR_STREAM,QUERY", 19) == 0)
    {
        handle_sensor_stream(cmd);
        return 1u;
    }

    if (!BleAtRepl_IsActive())
    {
        repl_send_err(ERR_STATE, "NOT_IN_REPL");
        return 1u;
    }

    if (handle_safe_or_common_cmd(cmd))
    {
        return 1u;
    }

    if (strncmp(cmd, "SENSOR_STREAM", 13) == 0)
    {
        handle_sensor_stream(cmd);
        return 1u;
    }

    if (strncmp(cmd, "DFLASH_", 7) == 0)
    {
        handle_dflash_cmd(cmd);
        return 1u;
    }

    repl_send_err(ERR_CMD, "UNKNOWN");
    return 1u;
}

void BleAtRepl_RunIfActive(void)
{
    if (!BleAtRepl_IsActive())
    {
        return;
    }

    if (Sys_GetBleState() != BLE_CONNECTED)
    {
        s_repl.stream_enabled = 0u;
        Sys_SetReplMode(0u);
        return;
    }

    if (s_repl.stream_enabled && is_timeout(s_repl.last_stream_ms, s_repl.stream_interval_ms))
    {
        s_repl.last_stream_ms = get_ticks_ms();
        switch (s_repl.stream_source)
        {
        case REPL_STREAM_SRC_ADC:
        {
            Adc_UpdateVdda();
            float vdda = Adc_GetVdda();
            repl_send("+DATA,ADC,VDDA_MV=%u\r\n", (unsigned)(uint32_t)(vdda * 1000.0f));
        }
        break;
        case REPL_STREAM_SRC_HALL:
        {
            uint8_t pb7_low = ((PB->PIN & BIT7) == 0u) ? 1u : 0u;
            uint8_t pb8_low = ((PB->PIN & BIT8) == 0u) ? 1u : 0u;
            repl_send("+DATA,HALL,PB7=%u,PB8=%u\r\n", pb7_low, pb8_low);
        }
        break;
        case REPL_STREAM_SRC_KEY:
        {
            uint8_t pressed = ((PB->PIN & BIT15) == 0u) ? 1u : 0u;
            repl_send("+DATA,KEY,PB15=%u\r\n", pressed);
        }
        break;
        case REPL_STREAM_SRC_GSENSOR:
        default:
        {
            int16_t axis[3] = {0};
            GsensorReadAxis(axis);
            repl_send("+DATA,GSENSOR,%d,%d,%d\r\n", axis[0], axis[1], axis[2]);
        }
        break;
        }
    }
}

#else

void BleAtRepl_Init(void) {}
uint8_t BleAtRepl_IsActive(void) { return 0u; }
uint8_t BleAtRepl_HandleMessage(const char *msg)
{
    (void)msg;
    return 0u;
}
void BleAtRepl_RunIfActive(void) {}

#endif
